// JS/HTML5, EDGE/CHROME/YANDEX                           *** Controller.js ***

// ****************************************************************************
// * KwinFlat                     Иммитировать некоторые действия контроллера *
// *                                                           из окна jquiry *
// ****************************************************************************

// v1.0.0, 01.02.2025                                 Автор:      Труфанов В.Е.
// Copyright © 2025 tve                               Дата создания: 01.02.2025

$(document).ready(function() 
{
   console.log("Controller");    
   
   $('#tabContainer').tabs({
  	   beforeActivate : function(evt) 
      {
  		   location.hash=$(evt.currentTarget).attr('href');
  	   },
		show: 'fadeIn',
  	   hide: 'fadeOut'
   });
   var hash = location.hash; 
	if (hash) 
   { 
		$('#tabContainer').tabs("load", hash) 
	} 
});
// ****************************************************************************
// *               Вызвать jquery-окно для иммитации контроллера              *
// ****************************************************************************
function ControllerClick()
{ 
   // По текущему состоянию режима окрашиваем фон элементов управления Led33 
   // и текст на них 
   console.log("ControllerClick");               
   $('#dial').dialog({
  	   autoOpen: true,
  	   width: 1000
   });
}
// ****************************************************************************
// *               Proba2            *
// ****************************************************************************
function Proba2()
{ 
   // По текущему состоянию режима окрашиваем фон элементов управления Led33 
   // и текст на них 
   console.log("Proba2");               
}

// ********************************************************** Controller.js ***
