<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                        *** UpSiteBODY.php ***

// ****************************************************************************
// * Lead                                Обеспечить управление контроллерами, *
// *                                 устройствами и датчиками моего хозяйства *
// ****************************************************************************

// v2.0.1, 26.12.2024                                 Автор:      Труфанов В.Е.
// Copyright © 2023 tve                               Дата создания: 08.10.2023

// ------------------------------------------------------------------- BODY ---

echo "<Lead>";
echo "</Lead>";

// <!-- --> ************************************************ UpSiteBODY.php ***
