<?php 
// PHP7/HTML5, YANDEX|EDGE/CHROME                       *** jsonState40.php ***

// ****************************************************************************
// * kwinflat.ru                    Реестр json-сообщений на страницу State40 *
// ****************************************************************************

// v4.0.1, 02.05.2025                                Автор:       Труфанов В.Е. 
// Copyright © 2025 tve                              Дата создания:  13.01.2025 

define ('s4_HIGH',    '{\"led4\":[{\"status\":\"shimHIGH\"}]}');                // "вспышка включена"
define ('s4_LOW',     '{\"led4\":[{\"status\":\"shimLOW\"}]}');                 // "вспышка ВЫКЛЮЧЕНА"

// ******************************************************** jsonState40.php *** 
