<?php namespace vlgo;

// PHP7/HTML5, EDGE/CHROME                                  *** isCalcS.php ***

// ****************************************************************************
// * KwinFlat.ru               Убедиться, что начисление считается от площади *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  26.02.2018
// Copyright © 2018 tve                              Посл.изменение: 26.02.2018

function isCalcS($Kind)
{
    $Result=False;
    if (($Kind==1)||($Kind==4))
	{
        $Result=True;
    }
    return $Result;
}
// ************************************************************ isCalcS.php ***
