<?php namespace vlgo;

// PHP7/HTML5, EDGE/CHROME                             *** ParamNachLgo.php ***

// ****************************************************************************
// * KwinFlat.ru                              Определить итоговое начисление, *
// *                         итоговый объем услуги и тариф для расчета льготы *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  26.02.2018
// Copyright © 2018 tve                              Посл.изменение: 30.05.2018

require_once $SiteRoot."/TViewLgo/isCalcS.php";

function ParamNachLgo($T,$Nach,$Korr,$S,$Kind,&$ItNach,&$Vu,&$Tlg,$Inusl)
{
    // Инициируем итоговый объем услуги и тариф для расчета льготы
    $Vu=0;
    $Tlg=0; 
    // Определяем итоговое начисление
    $ItNach=$Nach+$Korr;
    // Определяем итоговый объем услуги по площади и тариф для льготы
    if (isCalcS($Kind)) 
    {
        $Vu=$S;
        if (abs($S)>0.0001) $Tlg=round($ItNach/$S,2);
    }
    // Определяем итоговый объем услуги другого типа и тариф
    else
    {
        if (abs($T)>0.0001) {$Vu=round($ItNach/$T,4); $Tlg=$T;}
    }
    // Трассируем пересчитанные данные
    // echo "<br>ParamNachLgo: ".'$ItNach='.$ItNach.'  $Vu='.$Vu.'  $Tlg='.$Tlg.
    //    '  $Inusl='.$Inusl.'  $S='.$S;

}
// ******************************************************* ParamNachLgo.php ***

