<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                        *** Meet40HEAD.php ***

// ****************************************************************************
// * KwinFlat                        Подготовить стили и скрипты обслуживания *
// *                                       ознакомительной страницы для гостя *
// ****************************************************************************

// v4.0.0, 29.03.2025                                 Автор:      Труфанов В.Е.
// Copyright © 2024 tve                               Дата создания: 08.10.2024

// ---------------------------------------------------------- HEAD and LAST ---
// Подключаем переменные и константы JavaScript, соответствующие определениям в PHP
// DefineJS($SiteHost,$urlHome);
// Подключаем js и CSS
echo '<script src="Meet40/Meet40.js"></script>';
echo '<link href="Meet40/Meet40.css" rel="stylesheet">';

// end ------------------------------------------------------ HEAD and LAST ---

// <!-- --> ************************************************ Meet40HEAD.php ***
