<?php
// PHP7/HTML5, EDGE/CHROME                                  *** KwinFlat.ru ***

// ****************************************************************************
// *                                                   KwinFlat-близкий всем! *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  14.08.2016
// Copyright © 2016 tve                              Посл.изменение: 29.08.2018

// Явно запускаем сессию (независимо от состояния session.auto_start)
// session_start();

// Запускаем начальную страницу
require_once "Main.php";

// ************************************************************ KwinFlat.ru ***
?>
