<?php 
// PHP7/HTML5, EDGE/CHROME/YANDEX                            *** iniMem.php ***

// ****************************************************************************
// * SimaMark                   Выполнить начальную инициализацию переменных, *
// *  определить константы, создать классы для начального заполнения разметки *
// ****************************************************************************

// v1.0, 08.10.2023                                   Автор:      Труфанов В.Е.
// Copyright © 2023 tve                               Дата создания: 08.10.2023

// ************************************************************* iniMem.php *** 
