<?php                                           
// PHP7/HTML5, EDGE/CHROME                                  *** IniNorm.php ***

// ****************************************************************************
// * KwinFlat.ru                 Произвести установки общесайтовых переменных *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  01.11.2017
// Copyright © 2017 tve                              Посл.изменение: 14.03.2018

$aNorms =                                    // Меню нормативныз законов
[
    'Norms'         => 'Last',
    'NormPPRK129'   => 'ППРК129,27.08.2007',
    'NormPPRF541'   => 'ППРФ541,29.08.2005',
    'NormPPRK469'   => 'ППРК469,26.12.2017'
];      
                                            
$aNormu =                                    // Связь услуг с нормативами
[
    0               => 'Normu',
    1               => 'NormPPRK129',
    3               => OTOPL,
    7               => HVS,
    8               => GVS,
    151             => 'NormPPRK129',
    206             => 'NormPPRK129'
];      

// ************************************************************ IniNorm.php *** 

