<?php                                           
// PHP7/HTML5, EDGE/CHROME                            *** Introductions.php ***

// ****************************************************************************
// * KwinFlat.ru            Подключить вступление по соответствующей странице *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  01.01.2018
// Copyright © 2018 tve                              Посл.изменение: 11.05.2018

// "льготы по коммунальным услугам пенсионерам" 
//                       'Normativy_po_otopleniyu' = 'Main.php?Com=refNormotop'
// 

// ****************************************************** Introductions.php *** 

