<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                        *** UpSiteHEAD.php ***

// ****************************************************************************
// * SimaMark                   Указываем индивидуальные данные страниц сайта *
// *            для поисковых систем и пользователей, подключаем персональные *
// *                    стили для настольных и мобильных версий страниц сайта *
// ****************************************************************************

// v1.0, 08.10.2023                                   Автор:      Труфанов В.Е.
// Copyright © 2023 tve                               Дата создания: 08.10.2023

// ---------------------------------------------------------- HEAD and LAST ---

// end ------------------------------------------------------ HEAD and LAST ---

// <!-- --> ************************************************ UpSiteHEAD.php ***
