<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                        *** num3_DHT11.php ***

// ****************************************************************************
// * State             Обработать сообщение с num=3 - влажность и температура *
// ****************************************************************************

// v1.0.0, 15.04.2026                                 Автор:      Труфанов В.Е.
// Copyright © 2026 tve                               Дата создания: 15.04.2026

// Влажность = 46%, Температура = 24.8°C  
// 3 -> s_DHT11, '{"dht11":{"humi":46,"tempC":248}}'                           

// Обработать сообщение с влажностью и температурой
function DHT11($ctrl,$sjson)
{
  $messa='Ok-';
  return $messa;
} 

// ********************************************************* num3_DHT11.php ***
