<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                     *** num5_GPXtrkpt.php ***

// ****************************************************************************
// * State                      Обработать сообщение с num=5 - точка трека от *
//                             Sim900 в автомобиле (виртуального контроллера) *
// ****************************************************************************

// v1.0.0, 15.04.2026                                 Автор:      Труфанов В.Е.
// Copyright © 2026 tve                               Дата создания: 15.04.2026

// Точка трека: широта 61.856308, долгота 33.396584, цвет белый
// 5->s_GPXtrkpt, '{"trkpt":{"lat":61856308,"lon":33396584,"color":"white"}}' 

// Выполнить запись точки трека базу данных 
function GPXtrkpt($ctrl,$sjson)
{
  $messa='Ok';
  //$messa=PointToGpx($ctrl,$sjson); 
  return $messa;
} 

// ****************************************************************************
// *                   Выполнить запись точки трека в gpx-файл                *
// ****************************************************************************
function PointToGpx($ctrl,$sjson)
{
  $messa='Ok';
  $String=GlueLine(1,$ctrl,$sjson);
  PutLine($String);
  return $messa;
} 
// ****************************************************************************
// *         Склеить строку пользовательской информации для gpx-файла         *
// ****************************************************************************
function GlueLine($Page,$ctrl,$sjson,$BegSess=true)
{
  /*
  // Не выводим префикс, когда на это указано
  if ($Page=='') $Prefix='';
  // Формируем префикс строки по имени страницы. Если строка формируется в 
  // начале сессии ($BegSess=true), то префикс заключаем в '***', если в
  // продолжении сессии, то префикс заключаем в '==='.
  else
  {
    if ($BegSess==true) $Prefix='***'.$Page.'***';
    else $Prefix='==='.$Page.'===';
  }
  */
  $Prefix='*** ';
  // Подклеиваем остальную пользовательскую информацию
  $Result=
    $Prefix.
    "ctrl: $ctrl ".
    "sjson: $sjson \r\n".
    'Agent: $Uagent'."\r\n";
  return $Result;
}
// *************************************************************************
// *         Занести строку пользовательской информации в лог-файл         *
// *           (лог-файл разместить в корневом каталоге страницы)          *
// *************************************************************************
function PutLine($String)
{
  /*
  $LogName="fili";    
  $fp = fopen($LogName.".txt","a+");
  if (flock($fp,LOCK_EX)) 
  { 
    fputs($fp,$String);
    flock($fp, LOCK_UN); 
    fclose($fp);
  } 
  else 
  {
    echo "Не могу запереть файл! [".$LogName.".txt".']';  // Далее уйти в исключение
  }
  */
}


// ****************************************************** num5_GPXtrkpt.php ***
