// JS/HTML5, EDGE/CHROME/YANDEX                             *** ----Update40.js ***

// ****************************************************************************
// * -----KwinFlat                    Обслужить ознакомительную страницу для гостя *
// ****************************************************************************

// v4.5.2, 19.09.2025                                 Автор:      Труфанов В.Е.
// Copyright © 2025 tve                               Дата создания: 05.10.2024

//$(document).ready(function() 
//{
  console.log('State.js');
//});

// ************************************************************ Update40.js ***
