// JS/HTML5, EDGE/CHROME/YANDEX                               *** Meet40.js ***

// ****************************************************************************
// * KwinFlat                    Обслужить ознакомительную страницу для гостя *
// ****************************************************************************

// v4.0.0, 29.03.2025                                 Автор:      Труфанов В.Е.
// Copyright © 2025 tve                               Дата создания: 05.10.2024

$(document).ready(function() 
{
  console.log("Meet40.js");               
});

// ************************************************************** Meet40.js ***
