<?php                                           
// PHP7/HTML5, EDGE/CHROME      *** Sotsialnyye_normy_ploshchadi_zhilya.php ***

// ****************************************************************************
// * KwinFlat.ru            Подключить вступление по соответствующей странице *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  05.02.2018
// Copyright © 2018 tve                              Посл.изменение: 31.05.2018

//                 'Sotsialnyye_normy_ploshchadi_zhilya' = 'Main.php?Com=Norms'
//

function seot()
{
    echo "<title>О социальных нормах площади жилья</title>";
    echo "<meta name=\"description\" content=\"Установленные нормы площади жилья на одного человека: на одинокого - 38 кв.м общей площади; в семье из двух человек - 22,5 кв.м; из трех человек - 21 кв.м; из четырех и более человек - 18 кв.м\">";
    echo "<meta name=\"keywords\" content=\"определить норму площади, социальная норма жилья в Карелии, социальная норма площади, норма площади для компенсации\">";
}

function макеh1()
{
    echo "<h1 id=\"notesh1\">Как проверить расчет льгот по ЖКУ?</h1>";
}

function intro()
{
?>
<?php                                           
}

// ******************************** Sotsialnyye_normy_ploshchadi_zhilya.php *** 

