<?php namespace vnch;

// PHP7/HTML5, EDGE/CHROME                             *** ControlArray.php ***

// ****************************************************************************
// * KwinFlat.ru                       Проверить массив из кукисов и если все *
// *               хорошо, то заменить оперативный массив массивом из кукисов *
// ****************************************************************************


//                            УСТАРЕЛО



//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  04.02.2018
// Copyright © 2018 tve                              Посл.изменение: 03.03.2018

function ControlArray($NameArray,$aArray)
{
    $Result=$aArray;
    // Если есть кукисы по массиву, считываем их и разбираем на целостность
    if (IsSet($_COOKIE[$NameArray]))
    {
        $arr = unserialize($_COOKIE[$NameArray]);
        // Проверяем соответствие размерностей массивов
        //echo "<br>".$NameArray.': '.count($aArray).'<->'.count($arr);
        // Если количества совпадают, то переносим массив в работу
        if (count($aArray)==count($arr)) $Result=$arr;
    }
    return $Result;
}
// ******************************************************* ControlArray.php ***
