<?php namespace norms;

// PHP7/HTML5, EDGE/CHROME                                  *** MarkZhu.php ***

// ****************************************************************************
// * KwinFlat.ru              Выбрать нормы по категориям-услугам для расчета *
// *                                 вначале из кукисов, а затем генерировать *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  01.03.2018
// Copyright © 2018 tve                              Посл.изменение: 04.03.2018

function getZhuNorm($Domik,$Lgo,$db)
{
        // Инициируем нормативы
        for ($i=0;$i<$Lgo->UslCount;$i++){
        for ($j=0;$j<$Lgo->LgoCount;$j++)
        {
            echo "<br>".$i.'-'.$j;

        }}
}
// ************************************************************ MarkZhu.php ***

