<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                             *** index.php ***

// ****************************************************************************
// * Stream40                Принять и записать в базу видеопоток изображений *
// ****************************************************************************

// v1.2.0, 19.04.2025                                 Автор:      Труфанов В.Е.
// Copyright © 2025 tve                               Дата создания: 09.03.2025

// Инициализируем рабочее пространство: корневой каталог сайта и т.д.
require_once '../iniWorkSpace.php';
$_WORKSPACE=iniWorkSpace();
$SiteHost     = $_WORKSPACE[wsSiteHost];     // Каталог хостинга
require_once 'Stream40BODY.php';

// <!-- --> ***************************************************** index.php ***
