<?php


// рус

$apoints=array(
array(61.802094, 34.329613, 'ул.Виданская, д.17Б'),
array(61.766507, 34.364472, 'ул.Балтийская, д.59'),
array(61.675085, 34.563616, 'устье р.Нёлуксы'),
array(61.645326, 34.588221, 'развилка на Орзегу'),
array(61.606391, 34.651521, 'развилка на Деревянку'),
array(61.596684, 34.454465, 'сруб, построенный в Огоньке'),
array(61.702048, 34.154702, 'СНТ Эскулап, наша дача'),
array(61.773689, 34.133083, 'озеро Сердечко на Самбальском болоте'),
array(60.978825, 32.972443, 'улица Свирских Дивизий, 3, подъезд 1'),
array(61.606813, 30.563703, 'Центральная, 18 - Родительский дом'),
array(61.581059, 30.475955, 'остров Вуорисаари'),
array(61.802094, 34.329613, 'ул.Виданская, д.17Б')
);

?>