<?php 
// PHP7/HTML5, YANDEX|EDGE/CHROME                       *** jsonState40.php ***

// ****************************************************************************
// * kwinflat.ru                    Реестр json-сообщений на страницу State40 *
// ****************************************************************************

// v4.0.0, 24.04.2025                                Автор:       Труфанов В.Е. 
// Copyright © 2025 tve                              Дата создания:  13.01.2025 

define ('s4_HIGH',    '{\"led4\":[{\"status\":\"shimHIGH\"}]}');                // "вспышка включена"
define ('s4_LOW',     '{\"led4\":[{\"status\":\"shimLOW\"}]}');                 // "вспышка ВЫКЛЮЧЕНА"
define ('s4_MODE0',   '{\"led4\":[{\"regim\":0}]}');                            // "режим работы вспышки отключен"
define ('s4_MODEini', '{\"led4\":[{\"regim\":1,\"light\":10,\"time\":2000}]}'); // "начальный режим работы вспышки"

// Инициируем последнее принятое json-сообщение
$jState40=s4_MODE0;
// Определяем текущий режим работы вспышки
$s4_MODEcurr=s4_MODE0;
// Назначаем действующий режим работы вспышки
$jlight=10;   // процент времени свечения в цикле 
$jtime=2000;  // длительность цикла "горит - не горит" (мсек)      
$s4_MODE = '{\"led4\":[{\"regim\":1,\"light\":"+String(jlight)+",\"time\":"+String(jtime)"+"}]}';  

// ******************************************************** jsonState40.php *** 
