<?php
// PHP7/HTML5, EDGE/CHROME/YANDEX                      *** UpdateScreen.php ***

// ****************************************************************************
// * KwinFlat                 Обновить значения датчиков, состояния устройств *
// *                                         и контроллеров на странице сайта *
// ****************************************************************************

// v1.0, 05.10.2024                                   Автор:      Труфанов В.Е.
// Copyright © 2024 tve                               Дата создания: 05.10.2024

?>
<script>
// Запускаем вызав ежесекундного обновления экрана
const intervalId = setInterval(
function() 
{
  console.log('Я выполняюсь каждую секунду')
}
,990)
</script>
<?php

// <!-- --> ********************************************** UpdateScreen.php ***
